Revit 2017 API
View.Duplicate Method
 Duplicates this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2013
Syntax
C#
public ElementId Duplicate(
	ViewDuplicateOption duplicateOption
)
Visual Basic
Public Function Duplicate ( _
	duplicateOption As ViewDuplicateOption _
) As ElementId
Visual C++
public:
ElementId^ Duplicate(
	ViewDuplicateOption duplicateOption
)
Parameters
duplicateOption
Type: Autodesk.Revit.DB.ViewDuplicateOption
 The option to use when duplicating the view.
Return Value
 The id of the newly created view.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  View cannot be duplicated
See Also
View Class
Autodesk.Revit.DB Namespace